// Завдання 1
// Встановіть та налаштуйте prettier та eslint у своєму проекті з домашками. 
// Додайте pre-commit hook для запуску eslint перед кожним комітом.

// Prettier:
// - Автоформатування: Prettier призначений для автоматичного форматування коду, забезпечуючи однорідність у стилі та оформленні.
// - Підтримує різні мови програмування: Крім JavaScript, Prettier підтримує інші мови програмування, такі як HTML, CSS, JSON, YAML і т.д.
// - Для форматування всього файлу: Prettier форматує весь файл коду відповідно до своїх стандартів, без можливості вибору окремих правил для окремих частин коду.
// ESLint:
// - Статичний аналіз та правила: ESLint забезпечує статичний аналіз коду, перевірку синтаксичних помилок та виявлення стилістичних проблем. Він дає можливість налаштовувати правила стилю коду за допомогою конфігураційних файлів.
// - Розширення та налаштування: ESLint дозволяє використовувати різні правила для різних типів проектів та налаштовувати їх за власними потребами.
// - Кастомізація: ESLint дозволяє використовувати різні плагіни та розширення для розширення можливостей аналізу коду.



let obj1 = 10;
let obj2 = obj1;
obj2 += 10;
console.log(obj1); 
console.log(obj2);

