//Завдання 2: Конкатенація радків та шаблонний рядок
// Створіть дві змінні, які містять імена двох осіб. Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб. Виведіть результат в консоль. Потім використайте шаблонний рядок для створення того ж вітання. Виведіть результат в консоль.

const user1 = "Oleksi Lantukh";
const user2 = "John Doe";

const hello = "Hello " + user1 + " and " + user2;
console.log(hello);

let hello2 = `Hello ${user1} and ${user2}`;
console.log(hello2);